beomodern/Main_uP/Generated_Source/PSoC4/DATALINK_RESET.h
/*******************************************************************************
* File Name: DATALINK_RESET.h  
* Version 1.80
*
* Description:
*  This file containts Control Register function prototypes and register defines
*
* Note:
*
********************************************************************************
* Copyright 2008-2015, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
*******************************************************************************/

#if !defined(CY_CONTROL_REG_DATALINK_RESET_H) /* CY_CONTROL_REG_DATALINK_RESET_H */
#define CY_CONTROL_REG_DATALINK_RESET_H

#include "cyfitter.h"

#if ((CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC3) || \
     (CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC4) || \
     (CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC5))
    #include "cytypes.h"
#else
    #include "syslib/cy_syslib.h"
#endif

    
/***************************************
*     Data Struct Definitions
***************************************/

/* Sleep Mode API Support */
typedef struct
{
    uint8 controlState;

} DATALINK_RESET_BACKUP_STRUCT;


/***************************************
*         Function Prototypes 
***************************************/

void    DATALINK_RESET_Write(uint8 control) ;
uint8   DATALINK_RESET_Read(void) ;

void DATALINK_RESET_SaveConfig(void) ;
void DATALINK_RESET_RestoreConfig(void) ;
void DATALINK_RESET_Sleep(void) ; 
void DATALINK_RESET_Wakeup(void) ;


/***************************************
*            Registers        
***************************************/

/* Control Register */
#define DATALINK_RESET_Control        (* (reg8 *) DATALINK_RESET_Sync_ctrl_reg__CONTROL_REG )
#define DATALINK_RESET_Control_PTR    (  (reg8 *) DATALINK_RESET_Sync_ctrl_reg__CONTROL_REG )

#endif /* End CY_CONTROL_REG_DATALINK_RESET_H */


/* [] END OF FILE */
